This directory contains the R code used to generate the simulation
results presented in the article: "A sensitivity analysis to quantify
the impact of neuroimaging preprocessing strategies on subsequent
statistical analyses". It is organized as follows:
- *the BATCH files* define the simulation studies, one for each
  scenario (scenario 4 includes outliers but was not reported in the
  article). The output of the simulations were saved in a =Results=
  directory, not uploaded on Github to save space but available upon
  request. 
- *the FCT file* called by the BATCH file.
- *the FIGURE files* generate figures for the article.
- *the SLURM files* run the BATCH files on a computer cluster in parallel.
- *the BUILD file* gather the results of the various simulations by
  reading the data in the =Results= directory. It converts them into a
  a single table (=data.table= format) and exported in the =Results=
  directory as =simulation-scenario.rds=. These results are then
  condensed into summary statistics (e.g. rejection rate, bias, ...)
  exported in the file =simulation-summary-scenario.rds=.
- *the TEXT files* generate the text reported in the result section


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(LMMstar)
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 4.1.2 (2021-11-01)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Red Hat Enterprise Linux 8.6 (Ootpa)

Matrix products: default
BLAS:   /opt/software/R/4.1.2/lib64/R/lib/libRblas.so
LAPACK: /opt/software/R/4.1.2/lib64/R/lib/libRlapack.so

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] pbapply_1.5-0     lava_1.6.10       LMMstar_0.8.9     nlme_3.1-153     
[5] Matrix_1.3-4      mvtnorm_1.1-3     data.table_1.14.2

loaded via a namespace (and not attached):
 [1] compiler_4.1.2      pillar_1.8.1        tools_4.1.2        
 [4] digest_0.6.29       lifecycle_1.0.3     tibble_3.1.8       
 [7] gtable_0.3.1        lattice_0.20-45     pkgconfig_2.0.3    
[10] rlang_1.0.6         cli_3.4.1           parallel_4.1.2     
[13] coda_0.19-4         dplyr_1.0.10        globals_0.16.1     
[16] generics_0.1.3      vctrs_0.4.2         grid_4.1.2         
[19] tidyselect_1.1.2    glue_1.6.2          listenv_0.8.0      
[22] R6_2.5.1            parallelly_1.32.1   future.apply_1.9.1 
[25] fansi_1.0.3         survival_3.2-13     multcomp_1.4-20    
[28] TH.data_1.1-1       ggplot2_3.3.6       purrr_0.3.5        
[31] magrittr_2.0.3      scales_1.2.1        codetools_0.2-18   
[34] emmeans_1.8.1-1     MASS_7.3-54         splines_4.1.2      
[37] future_1.28.0       xtable_1.8-4        colorspace_2.0-3   
[40] numDeriv_2016.8-1.1 sandwich_3.0-2      utf8_1.2.2         
[43] estimability_1.4.1  munsell_0.5.0       zoo_1.8-11         
#+end_example
